artillery.yml
config:
  target: "http://localhost:8080"   # your Nest server
  phases:
    - duration: 60                  # run test for 60 seconds
      arrivalRate: 20               # 20 new virtual users per second
      name: "Warm up"
    - duration: 120                 # then 2 minutes of higher load
      arrivalRate: 50               # 50 new users per second
      name: "High load"

scenarios:
  - name: "Get cart by id"
    flow:
      - get:
          url: "/cart/1234567890abcdef12345678"  # some valid cart id